# Project Solution - Primary

You have to work on the [Kiva](https://drive.google.com/file/d/1-tJtnIbo1Rt-F1XfoWGVkmBXiI-ciuRx/view) dataset. Some information on the datasets are on the [Kaggle](https://www.kaggle.com/gaborfodor/additional-kiva-snapshot) web page.

## Basic tasks

**1.** Normalize the `loan_lenders` table. In the normalized table, each row must have one `loan_id` and one `lender`.

Firstly, csv file is read and data frame with unnormalized data is created:

In [1]:
import pandas as pd
import numpy as np
import time as tm
FINAL = True # This is final calculation, on complete data
start_time = tm.time()
loans_lenders_un = pd.read_csv('../../Datasets/kiva/loans_lenders.csv')
if not FINAL:
    loans_lenders_un = loans_lenders_un.head(10000) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lenders_un

--- 4.1969993114471436 seconds ---

         loan_id                                            lenders
0         483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1         483738  muc888, nora3555, williammanashi, barbara5610,...
2         485000  muc888, terrystl, richardandsusan8352, sherri4...
3         486087  muc888, james5068, rudi5955, daniel9859, don92...
4         534428  muc888, niki3008, teresa9174, mike4896, david7...
...          ...                                                ...
1387427   678999  michael43411218, carol5987, gooddogg1, chris41...
1387428  1207353  rjhoward1986, jeffrey6870, trolltech4460, elys...
1387429  1206220  vicky7746, gooddogg1, fairspirit, craig9729960...
1387430  1206425  rich6705, sergiiy9766, angela7509, barbara5610...
1387431  1206486                              alan5175, amy38101311

[1387432 rows x 2 columns]

Data frame with structured data will be created with help of intermediate object - list of pairs (loan_id, lender) packed in the dictionary:

In [2]:
import time as tm
start_time = tm.time()
lis = []
for index, row in loans_lenders_un.iterrows(): 
    ls = row['lenders'].split(',')
    for l in ls:
        lis.append({ 'loan_id' : row['loan_id'], 'lender': l.strip() })
loans_lender = pd.DataFrame(lis) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lender

--- 507.3094873428345 seconds ---

          loan_id             lender
0          483693             muc888
1          483693            sam4326
2          483693        camaran3922
3          483693        lachheb1865
4          483693        rebecca3499
...           ...                ...
28293926  1206425  trogdorfamily7622
28293927  1206425          danny6470
28293928  1206425            don6118
28293929  1206486           alan5175
28293930  1206486        amy38101311

[28293931 rows x 2 columns]

**2.** For each loan, add a column `duration` corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing.

Firstly, data frame should be loaded and structure of the data frame `loans` should be determined:

In [3]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
loans = pd.read_csv('../../Datasets/kiva/loans.csv')
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans.columns

--- 34.18983602523804 seconds ---

Index(['loan_id', 'loan_name', 'original_language', 'description',
       'description_translated', 'funded_amount', 'loan_amount', 'status',
       'activity_name', 'sector_name', 'loan_use', 'country_code',
       'country_name', 'town_name', 'currency_policy',
       'currency_exchange_coverage_rate', 'currency', 'partner_id',
       'posted_time', 'planned_expiration_time', 'disburse_time',
       'raised_time', 'lender_term', 'num_lenders_total',
       'num_journal_entries', 'num_bulk_entries', 'tags', 'borrower_genders',
       'borrower_pictured', 'repayment_interval', 'distribution_model'],
      dtype='object')

After thar, values from the data frame should be displayed:

In [4]:
if not FINAL:
    loans = loans.head(20000)
loans

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1419602,988180,NaN,NaN,NaN,NaN,400.0,400.0,funded,Tailoring,Services,...,2015-12-28 15:44:18.000 +0000,14.0,16,4,2,"#Parent, #Repeat Borrower, #Woman Owned Biz",NaN,NaN,monthly,field_partner
1419603,988213,Perlita,English,"Perlita is 52 years old, married and has three...","Perlita is 52 years old, married and has three...",300.0,300.0,funded,Pigs,Agriculture,...,2015-12-22 10:37:06.000 +0000,14.0,12,1,1,"#Animals, #Elderly, #Repeat Borrower, #Woman O...",female,true,irregular,field_partner
1419604,989109,Okyeso Nyame Group,English,Okyeso Nyame group will begin its third cycle ...,Okyeso Nyame group will begin its third cycle ...,2425.0,2425.0,funded,Bakery,Food,...,2015-12-26 20:24:47.000 +0000,8.0,76,2,1,"user_favorite, #Parent, #Vegan, #Woman Owned B...","female, female, female, male, male, female","true, true, true, true, true, true",irregular,field_partner
1419605,989143,Exequila,English,"Exequila is from San Miguel, Bohol. She is in...","Exequila is from San Miguel, Bohol. She is in...",100.0,100.0,funded,Farming,Agriculture,...,2015-12-06 21:03:57.000 +0000,12.0,3,1,1,NaN,female,true,irregular,field_partner
1419606,989240,Lydia,French,Lydia a 37ans et habite dans une zone rurale. ...,Lydia is 37 years old and lives in a rural are...,175.0,175.0,funded,Sewing,Services,...,2015-12-04 23:17:04.000 +0000,14.0,7,1,1,NaN,female,true,monthly,field_partner

We are now mainly interested in columns 'planned_expiration_time', 'disburse_time':

In [5]:
loans_sel = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time'] ]
loans_sel

,loan_id,loan_name,planned_expiration_time,disburse_time
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000
...,...,...,...,...
1419602,988180,NaN,2016-01-02 01:00:03.000 +0000,2015-11-23 08:00:00.000 +0000
1419603,988213,Perlita,2016-01-02 16:40:07.000 +0000,2015-11-24 08:00:00.000 +0000
1419604,989109,Okyeso Nyame Group,2016-01-03 22:20:04.000 +0000,2015-11-13 08:00:00.000 +0000
1419605,989143,Exequila,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000
1419606,989240,Lydia,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000

In [6]:
from datetime import datetime as dt
import time as tm
start_time = tm.time()
loans['duration'] = None
for index, row in loans.iterrows(): 
    s2 = row['planned_expiration_time']
    s1 = row['disburse_time']
    try:
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
    except ValueError:
        continue
    except TypeError:
        continue
    try:
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
    except ValueError:
        continue
    except TypeError:
        continue
    loans.loc[index,'duration'] = (d2 - d1).days 
loans_sel = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time', 'duration'] ]
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_sel

--- 24575.554668426514 seconds ---

,loan_id,loan_name,planned_expiration_time,disburse_time,duration
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,53
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,96
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,37
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,34
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,57
...,...,...,...,...,...
1419602,988180,NaN,2016-01-02 01:00:03.000 +0000,2015-11-23 08:00:00.000 +0000,39
1419603,988213,Perlita,2016-01-02 16:40:07.000 +0000,2015-11-24 08:00:00.000 +0000,39
1419604,989109,Okyeso Nyame Group,2016-01-03 22:20:04.000 +0000,2015-11-13 08:00:00.000 +0000,51
1419605,989143,Exequila,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000,63
1419606,989240,Lydia,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000,61

**3.** Find the lenders that have funded at least twice.

- Those are lenders that are duplicated in structured loan_leneders dataframe.

This solution is based on panda functionality:

In [7]:
import time as tm
start_time = tm.time()
loans_lender_2_more = loans_lender[loans_lender.duplicated(['lender'])]
lenders_funded_2_more = list(set(loans_lender_2_more['lender']))
print("--- %s seconds ---" % (tm.time()-start_time)) 
lenders_funded_2_more

--- 28.642706394195557 seconds ---

['aly7284',
 'nalini6364',
 'pieterwillem6242',
 'maya6627',
 'thomas3765',
 'gregorio9483',
 'brian4528',
 'charles5981',
 'johnandbonnie2312',
 'mauricio3668',
 'jayshrimepani',
 'tricia7795',
 'susie5136',
 'rue6928',
 'christy74573235',
 'gail2460',
 'alexandros5108',
 'chapulin',
 'jana6757',
 'erik8582',
 'nuno5385',
 'vaughn9760',
 'jeannette8546',
 'carolyn1002',
 'dimitris8183',
 'naoise2573',
 'deborah6858',
 'karsten7782',
 'samuele5855',
 'maureen8542',
 'basava4552',
 'jannette3875',
 'kathleen3209',
 'cita4809',
 'carol6049',
 'tohko8881',
 'jensolevigen4106',
 'chris32866274',
 'dean9185',
 'anna2526',
 'joshua5745',
 'ryan2941',
 'garvan5141',
 'tracey8145',
 'cascade5565',
 'margaret2040',
 'venita3714',
 'vijay8327',
 'marilyn6185',
 'jean5413',
 'kashay3779',
 'andrea9736',
 'henrietta8760',
 'jill5863',
 'lara2195',
 'jason4251',
 'karen56485081',
 'nancy8601',
 'mariette9011',
 'george3958',
 'heather1978',
 'sandy1452',
 'edith4108',
 'virginia2454',
 'george1497',
 'barret8194',
 'dawn8495',
 'kp8097',
 'robin7117',
 'katherine9000',
 'suzan5919',
 'michael58307680',
 'mazie8500',
 'nancy88741845',
 'stephen3149',
 'laura7502',
 'tristan3695',
 'suzanne9322',
 'robert5859',
 'lisa9459',
 'katharine3659',
 'olivia9632',
 'luke7335',
 'susan39793336',
 'angela24084560',
 'mathena',
 'bryant3720',
 'elysse7607',
 'leothomas7117',
 'beverly6799',
 'frans2398',
 'matthew5208',
 'rhonda4892',
 'corey6892',
 'johnston3691',
 'kent3235',
 'ereeny8815',
 'stacy1790',
 'wanda8010',
 'JimSTL',
 'bert8201',
 'troop331621102',
 'krishnarao7623',
 'lorraine6891',
 'shuhei6508',
 'luisdaniel1280',
 'maja5899',
 'alicia4189',
 'jackie66289058',
 'mgt491',
 'james47956599',
 'honeyb9787',
 'holmfridur8682',
 'maddie4455',
 'fabian3619',
 'mark6326',
 'lisette7850',
 'niklas5028',
 'ppaniagua',
 'reina5487',
 'bogeywebdesign',
 'ruth7223',
 'annas5310',
 'jonathan3897',
 'matjaz7196',
 'habeeb9072',
 'patricia94141146',
 'marcuskai7977',
 'vince7081',
 'grzegorz3764',
 'basil3069',
 'svams',
 'john97208007',
 'ross4021',
 'nauman4711',
 'alex68796245',
 'tommy3087',
 'sarah2380',
 'anne11254',
 'charity3096',
 'ayana6718',
 'jason73327115',
 'steven24313672',
 'russell1068',
 'james15848788',
 'christine3093',
 'shubs7814',
 'katherine1788',
 'talana9008',
 'jessica23189926',
 'annemarie1499',
 'ken7798',
 'marciaandphil7209',
 'tomandsharon9087',
 'mark2061',
 'steve5240',
 'cline9446',
 'fred6442',
 'bill99669582',
 'betsy4603',
 'mason7485',
 'anitra9192',
 'hicham8232',
 'rose3422',
 'lyanne1471',
 'nigel6811',
 'khalil5497',
 'anish7672',
 'kira2956',
 'urshia7653',
 'robert6220',
 'zach8123',
 'donandstaceyspage',
 'sabrinatheboz',
 'marion2870',
 'barry4937',
 'sandie7089',
 'sigrid3789',
 'joan6066',
 'jeff33522591',
 'donald8214',
 'robertjohn7828',
 'joana8594',
 'haritha9556',
 'lauren9432',
 'tom3863',
 'christina1211',
 'diane5387',
 'ester6362',
 'raina9492',
 'tomas2640',
 'christopher87722362',
 'tom2233',
 'anandhi9258',
 'jawwad4592',
 'ulverstonehighschool8405',
 'rosalyn8506',
 'shardul2681',
 'noam8803',
 'sangwon6998',
 'jimandbarbara5248',
 'AnnMarieCordia',
 'margot3160',
 'joe7384',
 'lillian6106',
 'mindi9692',
 'laura6103',
 'wilson7726',
 'jan4496',
 'mike1857',
 'victoria6547',
 'dowells',
 'james6353',
 'nancy2115',
 'tami3725',
 'david7036',
 'simo7367',
 'elishaandkumiko',
 'justin2818',
 'helene2815',
 'hadassah5626',
 'jennifer67438673',
 'don7281',
 'stefanie9191',
 'sheree4216',
 'mike7151',
 'alexandra8882',
 'margaret6435',
 'adrienne5268',
 'bethany3218',
 'solsticebahamas',
 'paul64114047',
 'christine22691188',
 'claire1919',
 'cheryl5453',
 'robert2447',
 'patrick5136',
 'kris9116',
 'daphne6807',
 'aaron5211',
 'scott1388',
 'james4167',
 'maryann6177',
 'mohammed5005',
 'walter9652',
 'kristina7024',
 'aoidrk1016',
 'thorleif8050',
 'sayaka4597',
 'cherie9922',
 'amelia9417',
 'cody9387',
 'annemaree5479',
 'steven2103',
 'pieterjan4380',
 'wendy1306',
 'judith9203',
 'nicholas2263',
 'ashley8531',
 'swapna4401',
 'jan5995',
 'nancy2964',
 'robin5368',
 'michele7147',
 'justyna5032',
 'jesse4016',
 'julie8057',
 'ericj1605',
 'ellen1690',
 'cindy9526',
 'barbro1398',
 'crystal5209',
 'lillian5428',
 'bethany8080',
 'jason9000',
 'lynne1484',
 'lars6465',
 'bonnieschildcare1450',
 'steven6409',
 'dianna1074',
 'falencia4824',
 'margaret7663',
 'nico7238',
 'tanya4351',
 'erika3868',
 'genesis7447',
 'michelle5736',
 'nate3436',
 'patrick3223',
 'bianca5735',
 'rory9080',
 'poughkeepsieday',
 'stacie6877',
 'marc7579',
 'diogo7017',
 'tina1095',
 'burkhard5617',
 'justin6690',
 'erin2973',
 'philippe2596',
 'rupa4282',
 'diane6589',
 'steve9619',
 'michel9974',
 'gary1117',
 'guillermo9195',
 'joann8213',
 'francesca9383',
 'carol3764',
 'diane5852',
 'amina4203',
 'joseph81361226',
 'mariamylove1556',
 'judith40845918',
 'vasanthh9394',
 'sigmundur9373',
 'irne6177',
 'robert54698399',
 'jessica6674',
 'jessica32396959',
 'james79117550',
 'olivia2806',
 'shirley5850',
 'peter38865752',
 'steve3069',
 'corinne5524',
 'logan7888',
 'jennifer8513',
 'kevin3553',
 'kareemulla1764',
 'rj9250',
 'susan96602787',
 'tj1554',
 'todd1076',
 'karlene1310',
 'mariah5921',
 'mindy9260',
 'alfred6471',
 'liz6803',
 'noga1185',
 'clare3469',
 'meaghan6913',
 'hillary6626',
 'birgit4148',
 'sydney8291',
 'frederic7112',
 'bob2131',
 'rhiannon7232',
 'mandebooks',
 'joanne4195',
 'cynthiagabriela4434',
 'kira88855002',
 'karina8819',
 'maaike2924',
 'carol5436',
 'nancy1006',
 'amy79001045',
 'janet5369',
 'jacky4704',
 'don6665',
 'gail7014',
 'paul4771',
 'christina2227',
 'tiffany4272',
 'melissa5640',
 'alessandro4695',
 'lisa51095786',
 'jackie8789',
 'randy1871',
 'dave33342214',
 'guido6317',
 'tarkan8525',
 'laura9308',
 'stephen32596921',
 'josephine8627',
 'christopher8772',
 'margarete7176',
 'kerry4601',
 'helen61536863',
 'michaela9978',
 'kjhay',
 'paulegraves',
 'alana2258',
 'dougandval',
 'aimee2363',
 'david9826',
 'john79873130',
 'kurt9567',
 'ricardo7464',
 'marina3266',
 'melanie4288',
 'ben5615',
 'caitlin2300',
 'wendyq',
 'kerrie6096',
 'julia7824',
 'annie3749',
 'murraythree',
 'laura6908',
 'rakesh7438',
 'julie33476379',
 'marketplace4626',
 'charles2969',
 'jaime29819582',
 'rich8269',
 'vanessa7218',
 'adrienne7569',
 'lori8068',
 'selincarroll',
 'suellen9887',
 'leslee5698',
 'saille4348',
 'roey8463',
 'debbie1789',
 'laura2411',
 'tawfeeq8645',
 'hernando3002',
 'juliette6324',
 'adam41196650',
 'alex3121',
 'iustina6267',
 'sanjgjin3001',
 'ali88041298',
 'alison9004',
 'michiel7996',
 'theresa8252',
 'gal6305',
 'john32615449',
 'jay60648894',
 'stefan7282',
 'michaelandgail1132',
 'isabel5352',
 'jezabel1241',
 'louis1440',
 'earla8090',
 'shana5966',
 'courtneyandglenn1907',
 'caleigh2664',
 'nick1309',
 'sharon1746',
 'christine33517626',
 'lotte4426',
 'sheetal3596',
 'sharron3676',
 'jeff72449101',
 'pat3826',
 'heather86631091',
 'jennifer83386666',
 'yuko1176',
 'anette3052',
 'philip7408',
 'catlondon',
 'terri96237543',
 'lee88309470',
 'elena8926',
 'brad8819',
 'brian4002',
 'hunter6968',
 'gary9070',
 'orion6581',
 'john73808218',
 'greg8571',
 'ajah3465',
 'gregory8097',
 'gerritjahn',
 'christina4726',
 'roberto9207',
 'johanna1905',
 'danny73241094',
 'james14238346',
 '0634944',
 'murdho1048',
 'carolyn8574',
 'libbyandrewdevin7404',
 'david7216',
 'brian27811082',
 'sergio4289',
 'shane2527',
 'nina4397',
 'tone6969',
 'rollande5621',
 'paul8610',
 'nancy59385941',
 'marilyn8212',
 'reinhard8046',
 'justin8747',
 'susan8198',
 'mauvis8217',
 'jerada5519',
 'jerry6762',
 'pcdazero',
 'msmcginns6thhourclas9243',
 'diana75917606',
 'gabe1101',
 'ben82608575',
 'charles65878884',
 'vanessa3572',
 'susan5161',
 'arild1898',
 'gustav2959',
 'danielle78586401',
 'jon4622',
 'santhoshkumar6552',
 'sue6521',
 'kevin5480',
 'natalie5693',
 'leif2617',
 'dangina3668',
 'carolyn9321',
 'ronyuk',
 'rob4085',
 'georgaustria',
 'andrea2431',
 'marian2982',
 'antonio2050',
 'lyn7707',
 'rebekah3802',
 'steven6381',
 'KenLaneUS',
 'joanherschel1651',
 'juancamilo6627',
 'diane2082',
 'scott2022',
 'elizabethswl',
 'karen7824',
 'anne63',
 'konrad4760',
 'johnandpatti8669',
 'virginia9714',
 'simon9100',
 'chrisandwhitney9429',
 'stu',
 'melissa7557',
 'joann',
 'steven3773',
 'faulhaberpr5879',
 'kate5291',
 'jiri1157',
 'kris4038',
 'dlamar3399',
 'kareem1417',
 'paul7687',
 'natascha1360',
 'jennifer4572',
 'angelique2142',
 'neil4801',
 'lisa9441',
 'kaiya1653',
 'lisa4798',
 'jayk',
 'patricia1975',
 'dan4111',
 'shinobu5514',
 'jonathan7976',
 'amy97555429',
 'lisa6322',
 'chris19358983',
 'tommi3204',
 'abk1529',
 'mariefrance5070',
 'latoya3453',
 'dan43332673',
 'anne6386',
 'josephgarcia',
 'jo4862',
 'anil2562',
 'niklas5852',
 'susan73913012',
 'jamie4466',
 'christina23485821',
 'greg9270',
 'rob5924',
 'abdul1589',
 'jim7314',
 'lorna8507',
 'jennifer4043',
 'liz8337',
 'paul78006745',
 'ginger5339',
 'andrea1856',
 'leigh9465',
 'linda20307770',
 'dan5838',
 'nancy1387',
 'emily9064',
 'carrie6820',
 'qinoone5986',
 'michael2840',
 'zlata3694',
 'silvia6629',
 'jonathan68967009',
 'margie3144',
 'robert9125',
 'amy7567',
 'anne9134',
 'helena8339',
 'scott17703187',
 'girlpower',
 'susan6136',
 'bill17103866',
 'tess1937',
 'john43398887',
 'vivek3137',
 'saturnino9985',
 'davidwright2009',
 'greg8957',
 'erin1384',
 'james81967973',
 'henry7469',
 'autumn9391',
 'tracy1480',
 'andrew9422',
 'lynnjim6736',
 'idamaria2891',
 'jayme9013',
 'julie2646',
 'emily25484098',
 'dorothy74089394',
 'caroline7480',
 'francesca2495',
 'olivia3182',
 'ioakim4338',
 'dennis6600',
 'sharon7425',
 'melissa35144610',
 'joshua2709',
 'istkivau9697',
 'jason2685',
 'rebeccareis',
 'kareen4313',
 'hilde5864',
 'elie8682',
 'nikola3251',
 'holly5098',
 'grant2981',
 'laura8402',
 'amanda2237',
 'florent8109',
 'lawna3218',
 'jeff1089',
 'peoplewholovepeople',
 'suesan7198',
 'sheri6463',
 'tanya9369',
 'audrey3118',
 'kate6121',
 'shauna8319',
 'corey3887',
 'mayra3885',
 'kaleigh1211',
 'katie3439',
 'maria9140',
 'kovacsszabo2343',
 'victor5292',
 'ian7102',
 'sonny1767',
 'melvin6858',
 'lowell7693',
 'linda1911',
 'colin2031',
 'john54183662',
 'amber6846',
 'monica9817',
 'anacalvertkilbane',
 'maralyonsfamily1110',
 'mskormashseslclass9090',
 'matt2940',
 'priscilla3189',
 'lene6749',
 'shova7363',
 'alex1553',
 'paul67934416',
 'meera4182',
 'marko1896',
 'john5029',
 'maria4695',
 'margaret24192412',
 'tanja4992',
 'hagop2264',
 'jenny7437',
 'ambra4862',
 'sharon6769',
 'sadamitsu2891',
 'carla49013491',
 'amy6769',
 'ameeta9286',
 'thorben6929',
 'megan4298',
 'monica9315',
 'margaret7360',
 'eric9293',
 'pragoon5310',
 'wilson8025',
 'matthew9834',
 'ora',
 'henrik2588',
 'lana9714',
 'kevin36545229',
 'lynne5022',
 'lynn75463159',
 'jan8353',
 'ian5031',
 'deirdre3369',
 'jason7784',
 'rob9548',
 'christie5738',
 'liz6390',
 'glen7478',
 'eric9854',
 'roseann5018',
 'amanda54155937',
 'angela43946086',
 'jeanne5418',
 'collin3405',
 'diane7741',
 'jake1730',
 'sarah9354',
 'benjamin3236',
 'mayrajohannes4268',
 'tripti5245',
 'emily9403',
 'fred3784',
 'victoria5265',
 'greg9011',
 'kyle6448',
 'emma2740',
 'larry3164',
 'linda9191',
 'ivan1853',
 'jenifer7077',
 'kelley6383',
 'divinadelsol',
 'catherine7752',
 'pradyumna8788',
 'sam2639',
 'theresa4145',
 'susie8717',
 'jennifer4571',
 'jessica59729249',
 'gerard4011',
 'shiela3507',
 'keri7241',
 'lydia9511',
 'felipe9529',
 'kathleen2957',
 'barbara4413',
 'donna5064',
 'andrew92799246',
 'simon4685',
 'nancyxiaoliang',
 'ray7301',
 'auryn3845',
 'cambria8223',
 'janet34452594',
 'katie5513',
 'kathryn5858',
 'alexander2588',
 'toussaint8248',
 'joann2246',
 'darcy3763',
 'pauline8135',
 'cecilia5332',
 'ward7424',
 'carole3300',
 'rama2542',
 'william7274',
 'danny',
 'benjamin21565890',
 'alice5263',
 'orlando9646',
 'family7110',
 'amber9902',
 'melodie4527',
 'jeff75591300',
 'courtneyjean',
 'eva1894',
 'orlando9566',
 'lisa6821',
 'alain1966',
 'tammy9675',
 'chris4675',
 'morten5725',
 'markus8762',
 'kelsey1505',
 'kevin9874',
 'trevor4701',
 'doug7547',
 'madeleine4267',
 'hobson1347',
 'merka',
 'abdulrahman7654',
 'kim5144',
 'paul7564',
 'sherri9964',
 'roseanne6769',
 'janel5366',
 'jonas7932',
 'raysofthesun',
 'zachary7983',
 'hanina6516',
 'mike2894',
 'mary9946',
 'vo9550',
 'kurt9914',
 'eric44161160',
 'enzo7631',
 'somuchsong',
 'seppo1068',
 'renata9510',
 'ashley16885097',
 'david2891',
 'pam97587307',
 'ahmad6307',
 'homer8718',
 'linda1420',
 'sam3113',
 'paul6538',
 'sjoerd1819',
 'jonathan79015815',
 'janelle9558',
 'dotsie8155',
 'catherine6510',
 'susan47332719',
 'hyunjung8517',
 'jack9197',
 'john66461189',
 'irma8611',
 'liedra',
 'wytz8475',
 'janice1527',
 'mario4762',
 'brent5633',
 'fridtjof',
 'tomislav5559',
 'marvin9227',
 'christine14387973',
 'carol5119',
 'itsfinance4653',
 'maria8526',
 'john39868908',
 'mary5346',
 'sarah44199019',
 'karen91104978',
 'sookfun6871',
 'charles9462',
 'paul4103',
 'kelley5279',
 'rebecca50225738',
 'brian1221',
 'genevieve3597',
 'susan6779',
 'olaf6111',
 'victoria6271',
 'wanda8542',
 'kivafdl',
 'mary6497',
 'mike14288949',
 'kate5115',
 'eve2820',
 'tootsiebella',
 'brooke9162',
 'ian2296',
 'paul9609',
 'susan62089894',
 'hultman',
 'mia7458',
 'kate5966',
 'chris58119184',
 'nigel4971',
 'andy2383',
 'ted5588',
 'christina82613252',
 'marcia9938',
 'vanessa7358',
 'georgia1377',
 'ricardo3199',
 'per1084',
 'walid8189',
 'omar3388',
 'micha4444',
 'david29319464',
 'magda1428',
 'kathryn6395',
 'clark2571',
 'patty5870',
 'christine19',
 'hankandangela',
 'christian1225',
 'anna1453',
 'stuart3988',
 'peter6373',
 'kdawg',
 'steven9912',
 'hunter1878',
 'hannah1291',
 'dan1218',
 'francisco2209',
 'roberta2431',
 'martin9365',
 'edwin3932',
 'natalie3085',
 'art5008',
 'stefan2327',
 'patricia6626',
 'rebekah8479',
 'aaron4283',
 'kenneth3139',
 'andrea6992',
 'deborah9514',
 'trevor7663',
 'andrew7322',
 'toni8657',
 'nat9435',
 'k5070',
 'leslie8820',
 'rachael6713',
 'cindy9679',
 'simon8976',
 'miran',
 'rochelle5322',
 'kristina5106',
 'julian1502',
 'acia1195',
 'kevin49074857',
 'katherine3532',
 'lbdns7853',
 'sean6958',
 'barbara5036',
 'eric84021527',
 'arpit5294',
 'rob6340',
 'michael54554161',
 'ken5471',
 'luca2116',
 'johntracey8890',
 'jennifer39051663',
 'jay8880',
 'timothy4097',
 'trudy1355',
 'timothy4482',
 'wendy8384',
 'arnaud3139',
 'melia8594',
 'casey9159',
 'daniel5112',
 'karin3692',
 'alisha7777',
 'marylou6414',
 'yolanda7118',
 'nabho5284',
 'matthew8667',
 'anita5937',
 'evelyn2190',
 'aart5690',
 'yigal1179',
 'christian6015',
 'william0831',
 'marcia7830',
 'doug8882',
 'misobrinamayor',
 'barbara9958',
 'martin8086',
 'louise8239',
 'lizzie1773',
 'ling5919',
 'birgitbau4827',
 'stephanie52364228',
 'juliet8469',
 'angela5119',
 'michele4625',
 'chaiyasit4171',
 'chris1194',
 'mariana5040',
 'caroline5392',
 'andre20172754',
 'alina1266',
 'janice2694',
 'pam9553',
 'jairo9835',
 'david79426294',
 'farhang8568',
 'jaakkok',
 'luissantos84',
 'christian7909',
 'susan4249',
 'fergal2163',
 'alyanna6893',
 'ann9329',
 'duc2733',
 'girish3243',
 'larry5378',
 'ingra4959',
 'michael70962939',
 'jacqueline7368',
 'kenneth9297',
 'andredessens',
 'chloe85386835',
 'tina3152',
 'hilal7202',
 'blane',
 ...]

**4.** For each country, compute how many loans have involved that country as borrowers.

- This solution is based on panda grouping:

In [8]:
import time as tm
start_time = tm.time()
loans_count = loans.groupby(['country_code','country_name'], as_index=False)[['loan_id']].count()
loans_count.columns = ['country_code','country_name','loan_id_count']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_count

--- 0.5570371150970459 seconds ---

   country_code            country_name  loan_id_count
0            AF             Afghanistan           2337
1            AL                 Albania           3075
2            AM                 Armenia          13952
3            AZ              Azerbaijan          10172
4            BA  Bosnia and Herzegovina            608
..          ...                     ...            ...
90           XK                  Kosovo           2178
91           YE                   Yemen           4206
92           ZA            South Africa            633
93           ZM                  Zambia           1277
94           ZW                Zimbabwe           5513

[95 rows x 3 columns]

**5.** For each country, compute the overall amount of money borrowed.

- This solution is based on panda grouping:

In [9]:
import time as tm
start_time = tm.time()
loans_sum = loans.groupby(['country_code','country_name'], as_index = False)[['loan_amount']].sum()
loans_sum.columns = ['country_code','country_name','loan_amount_sum']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_sum

--- 0.35497236251831055 seconds ---

   country_code            country_name  loan_amount_sum
0            AF             Afghanistan        1967950.0
1            AL                 Albania        4307350.0
2            AM                 Armenia       22950475.0
3            AZ              Azerbaijan       14784625.0
4            BA  Bosnia and Herzegovina         477250.0
..          ...                     ...              ...
90           XK                  Kosovo        3083025.0
91           YE                   Yemen        3444000.0
92           ZA            South Africa        1006525.0
93           ZM                  Zambia        1978975.0
94           ZW                Zimbabwe        5851875.0

[95 rows x 3 columns]

**6.** Like the previous point, but expressed as a percentage of the overall amount lent.

- This solution is based on panda functions:

In [10]:
import time as tm
start_time = tm.time()
loans_total = loans['loan_amount'].sum()
loans_percent = loans.groupby(['country_code','country_name'], as_index = False)[['loan_amount']].sum()
loans_percent.columns = ['country_code','country_name','loan_amount_sum']
loans_percent['percent'] = loans_percent['loan_amount_sum']/loans_total*100
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_percent

--- 0.6792972087860107 seconds ---

   country_code            country_name  loan_amount_sum   percent
0            AF             Afghanistan        1967950.0  0.166573
1            AL                 Albania        4307350.0  0.364586
2            AM                 Armenia       22950475.0  1.942589
3            AZ              Azerbaijan       14784625.0  1.251410
4            BA  Bosnia and Herzegovina         477250.0  0.040396
..          ...                     ...              ...       ...
90           XK                  Kosovo        3083025.0  0.260955
91           YE                   Yemen        3444000.0  0.291509
92           ZA            South Africa        1006525.0  0.085195
93           ZM                  Zambia        1978975.0  0.167506
94           ZW                Zimbabwe        5851875.0  0.495318

[95 rows x 4 columns]

**7.** Like the three previous points, but split for each year (with respect to `disburse time`).

- This solution is based on panda functions:

In [11]:
import time as tm
start_time = tm.time()
from datetime import datetime as dt
loans_total = loans['loan_amount'].sum()
loans['disburse_time_year'] = None
for index, row in loans.iterrows():
    try:
        y = dt.strptime(row['disburse_time'], "%Y-%m-%d %H:%M:%S.%f %z").year
    except TypeError:
        y = None
    except ValueError:
        y = None
    loans.loc[index,'disburse_time_year'] = y 
loans_agg = loans.groupby(['country_code','country_name','disburse_time_year'\
                          ], as_index = False).agg({'loan_id':['count'],\
                                                    'loan_amount':['sum', lambda x: x.sum()/loans_total*100]})
loans_agg.columns = ['country_code','country_name','disburse_time_year','loan_id_count', \
                     'loan_amount_sum','loan_amount_percent']
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_agg

--- 48767.20305228233 seconds ---

,country_code,country_name,disburse_time_year,loan_id_count,loan_amount_sum,loan_amount_percent
0,AF,Afghanistan,2007,408,194975.0,0.016503
1,AF,Afghanistan,2008,370,365375.0,0.030926
2,AF,Afghanistan,2009,678,585125.0,0.049527
3,AF,Afghanistan,2010,632,563350.0,0.047683
4,AF,Afghanistan,2011,247,245125.0,0.020748
...,...,...,...,...,...,...
740,ZW,Zimbabwe,2013,426,678525.0,0.057432
741,ZW,Zimbabwe,2014,2078,1311575.0,0.111015
742,ZW,Zimbabwe,2015,600,723625.0,0.061250
743,ZW,Zimbabwe,2016,808,788600.0,0.066749
744,ZW,Zimbabwe,2017,1079,1237600.0,0.104754

**8.** For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

- This solution is based on panda functions:

In [12]:
import time as tm
start_time = tm.time()
merged = pd.merge(left=loans_lender,right=loans, left_on='loan_id', right_on='loan_id')
merged = merged[['loan_id','lender', 'loan_amount']]
number_of_lenders_by_loan_id = merged.groupby(['loan_id'], as_index = False)[['lender']].count()
number_of_lenders_by_loan_id
merged2 = pd.merge(left=merged,right=number_of_lenders_by_loan_id, left_on='loan_id', right_on='loan_id')
merged2['precise_amount'] = merged2.loan_amount / merged2.lender_y
merged2
lent_by_lender = merged2.groupby(['lender_x'], as_index = False)[['precise_amount']].sum()
print("--- %s seconds ---" % (tm.time()-start_time)) 
lent_by_lender
#result.loc[result['lender_x'] == 'muc888'] # result for one lender

--- 4879.449104070663 seconds ---

               lender_x  precise_amount
0                   000     1764.285078
1                 00000     1380.693644
2                  0002     2472.563566
3              00mike00       52.631579
4        0101craign0101     2623.565117
...                 ...             ...
1383794        zzmcfate    66113.226325
1383795  zzpaghetti9994       51.020408
1383796      zzrvmf8538      576.978086
1383797          zzzsai      267.667370
1383798        zzzworld       27.522936

[1383799 rows x 2 columns]

**9.** For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [13]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
lenders = pd.read_csv('../../Datasets/kiva/lenders.csv')
if not FINAL:
    lenders = lenders.head(20000) 
lender_states = lenders[['permanent_name','country_code']]
lender_states

         permanent_name country_code
0              qian3013          NaN
1             reena6733          NaN
2               mai5982          NaN
3        andrew86079135          NaN
4            nguyen6962          NaN
...                 ...          ...
2349169       janet7309          NaN
2349170          pj4198          NaN
2349171       maria2141           US
2349172      simone9846          NaN
2349173      laurie1160           US

[2349174 rows x 2 columns]

In [14]:
lenders_in_states = lender_states.loc[lender_states['country_code'].notnull()]
lenders_in_states

            permanent_name country_code
16              naresh2074           US
31       christina27976796           US
37               vikas1098           IN
39                qian1385           US
42                xigg8769           US
...                    ...          ...
2349158              rakhi           US
2349159          vicki5374           US
2349161       jennifer5879           CA
2349171          maria2141           US
2349173         laurie1160           US

[890539 rows x 2 columns]

In [15]:
lenders_without_states = lender_states.loc[lender_states['country_code'].isnull()]
lenders_without_states

         permanent_name country_code
0              qian3013          NaN
1             reena6733          NaN
2               mai5982          NaN
3        andrew86079135          NaN
4            nguyen6962          NaN
...                 ...          ...
2349167        todd5695          NaN
2349168    kate40761039          NaN
2349169       janet7309          NaN
2349170          pj4198          NaN
2349172      simone9846          NaN

[1458635 rows x 2 columns]

In [16]:
lent_and_state = pd.merge(left=lent_by_lender, right=lenders_in_states, left_on='lender_x', right_on='permanent_name')
lent_total = lent_and_state['precise_amount'].sum()
lent_by_state = lent_and_state.groupby(['country_code'], as_index = False\
                                      ).agg({'precise_amount':['count', 'sum', \
                                                               lambda x: x.sum()/lent_total]})
lent_by_state.columns = ['country_code', 'lent_count', 'lent_sum', 'lent_factor']
lent_by_state

    country_code  lent_count      lent_sum   lent_factor
0             AD           9  4.912436e+03  5.295105e-06
1             AE         667  1.769248e+06  1.907069e-03
2             AF         124  1.074489e+05  1.158190e-04
3             AG           3  6.182085e+02  6.663656e-07
4             AI           1  3.350203e+02  3.611176e-07
..           ...         ...           ...           ...
220           YE          51  1.673080e+04  1.803409e-05
221           YT           1  5.970588e+01  6.435684e-08
222           ZA         659  5.338213e+05  5.754048e-04
223           ZM          17  3.317287e+04  3.575697e-05
224           ZW          12  5.392028e+03  5.812056e-06

[225 rows x 4 columns]

In [17]:
lent_no_state = pd.merge(left=lent_by_lender, right=lenders_without_states, \
                         left_on='lender_x', right_on='permanent_name')
lent_no_state_total = lent_no_state['precise_amount'].sum()
lent_no_state_total

235702701.9289114

In [18]:
lent_by_state['additional_lent'] = lent_by_state.lent_factor * lent_no_state_total
lent_by_state

    country_code  lent_count      lent_sum   lent_factor  additional_lent
0             AD           9  4.912436e+03  5.295105e-06      1248.070449
1             AE         667  1.769248e+06  1.907069e-03    449501.211979
2             AF         124  1.074489e+05  1.158190e-04     27298.840916
3             AG           3  6.182085e+02  6.663656e-07       157.064178
4             AI           1  3.350203e+02  3.611176e-07        85.116403
..           ...         ...           ...           ...              ...
220           YE          51  1.673080e+04  1.803409e-05      4250.683852
221           YT           1  5.970588e+01  6.435684e-08        15.169082
222           ZA         659  5.338213e+05  5.754048e-04    135624.477154
223           ZM          17  3.317287e+04  3.575697e-05      8428.014749
224           ZW          12  5.392028e+03  5.812056e-06      1369.917268

[225 rows x 5 columns]

In [19]:
loan_and_state = loans[['loan_id','country_code','loan_amount']]
loan_and_state

         loan_id country_code  loan_amount
0         657307           PH        125.0
1         657259           HN        400.0
2         658010           PK        400.0
3         659347           KG        625.0
4         656933           PH        425.0
...          ...          ...          ...
1419602   988180           KE        400.0
1419603   988213           PH        300.0
1419604   989109           GH       2425.0
1419605   989143           PH        100.0
1419606   989240           MG        175.0

[1419607 rows x 3 columns]

In [20]:
loan_by_state = loan_and_state.groupby(['country_code'], as_index = False).agg({'loan_amount':['sum']})
loan_by_state.columns = ['country_code','loan_amount_sum']
loan_by_state

   country_code  loan_amount_sum
0            AF        1967950.0
1            AL        4307350.0
2            AM       22950475.0
3            AZ       14784625.0
4            BA         477250.0
..          ...              ...
90           XK        3083025.0
91           YE        3444000.0
92           ZA        1006525.0
93           ZM        1978975.0
94           ZW        5851875.0

[95 rows x 2 columns]

In [21]:
loan_and_lent = pd.merge(loan_by_state, lent_by_state, how='left', on=['country_code'])
loan_and_lent['difference'] = loan_and_lent.loan_amount_sum - loan_and_lent.lent_sum - loan_and_lent.additional_lent 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loan_and_lent[loan_and_lent.difference == loan_and_lent.difference.max()]

--- 21.760595083236694 seconds ---

,country_code,loan_amount_sum,lent_count,lent_sum,lent_factor,additional_lent,difference
61,PH,97984600.0,910.0,765759.181625,0.000825,194551.413275,9.702429e+07

**10.** Which country has the highest ratio between the difference computed at the previous point and the population?

In [31]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
country_stat = pd.read_csv('../../Datasets/kiva/country_stats.csv')
country_stat = country_stat[['country_code', 'country_name', 'population', 'population_below_poverty_line']]
country_stat = country_stat.dropna(subset=['population_below_poverty_line'])
country_stat

    country_code  country_name  population  population_below_poverty_line
0             IN         India  1339180127                           21.9
1             NG       Nigeria   190886311                           70.0
2             MX        Mexico   129163276                           46.2
3             PK      Pakistan   197015955                           29.5
4             BD    Bangladesh   164669751                           31.5
..           ...           ...         ...                            ...
147           MT         Malta      430835                           16.3
148           MV      Maldives      436330                           16.0
149           ME    Montenegro      628960                            8.6
150           TM  Turkmenistan     5758075                            0.2
173           XK        Kosovo     1895250                           30.0

[152 rows x 4 columns]

In [33]:
country_stat_loan_and_lent = pd.merge(left=country_stat, right=loan_and_lent, \
                                      left_on='country_code', right_on='country_code')
country_stat_loan_and_lent = country_stat_loan_and_lent[['country_code', 'country_name', 'difference', \
                                                         'population', 'population_below_poverty_line']]
country_stat_loan_and_lent['ratio_1'] = country_stat_loan_and_lent.difference/country_stat_loan_and_lent.population
print("--- %s seconds ---" % (tm.time()-start_time)) 
country_stat_loan_and_lent[country_stat_loan_and_lent.ratio_1 == country_stat_loan_and_lent.ratio_1.max()]

--- 59.55899930000305 seconds ---

,country_code,country_name,difference,population,population_below_poverty_line,ratio_1
63,PY,Paraguay,5.389790e+07,6811297,22.2,7.913015

As we can see, Paraguay has  highest ratio between the difference computed at the previous point and the population.

Country with the lowest ratio between the difference computed at the previous point and the population can be calculated on the following way:

In [34]:
country_stat_loan_and_lent[country_stat_loan_and_lent.ratio_1 == country_stat_loan_and_lent.ratio_1.min()]

,country_code,country_name,difference,population,population_below_poverty_line,ratio_1
48,CA,Canada,-9.809674e+07,36624199,9.4,-2.678468

**11.** Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

In [35]:
import time as tm
start_time = tm.time()
country_stat_loan_and_lent = pd.merge(left=country_stat, right=loan_and_lent, \
                                      left_on='country_code', right_on='country_code')
country_stat_loan_and_lent = country_stat_loan_and_lent[['country_code', 'country_name', 'difference', \
                                                         'population', 'population_below_poverty_line']]
country_stat_loan_and_lent['ratio_2'] = country_stat_loan_and_lent.difference\
/(country_stat_loan_and_lent.population * ((100-country_stat_loan_and_lent.population_below_poverty_line)/100) )
print("--- %s seconds ---" % (tm.time()-start_time)) 
country_stat_loan_and_lent[country_stat_loan_and_lent.ratio_2 == country_stat_loan_and_lent.ratio_2.max()]

--- 0.009996175765991211 seconds ---

,country_code,country_name,difference,population,population_below_poverty_line,ratio_2
71,AM,Armenia,2.292073e+07,2930450,32.0,11.502316

As we can see, Armenia has  highest ratio between the difference computed at the point 9. and the population that is not below the poverty line.

Country with the lowest ratio between the difference computed at the point 9. and the population that is not below the poverty line can be calculated on the following way:

In [36]:
country_stat_loan_and_lent[country_stat_loan_and_lent.ratio_2 == country_stat_loan_and_lent.ratio_2.min()]

,country_code,country_name,difference,population,population_below_poverty_line,ratio_2
48,CA,Canada,-9.809674e+07,36624199,9.4,-2.956366

**12.** For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.

In [29]:
import time as tm
start_time = tm.time()

from datetime import datetime as dt, timezone as tz

now = dt.now(tz.utc)

def days_in_year(year):
    d1 = dt.strptime( str(year)+'-01-01', "%Y-%m-%d") 
    d1 = d1.replace(tzinfo=None)
    d2 = dt.strptime( str(year)+'-12-31', "%Y-%m-%d")
    d2 = d2.replace(tzinfo=None)
    return (d2-d1).days+1

def total_amount_of_loans(disb, plan_exp, amount):
    if( disb.year == plan_exp.year ):
        return [(disb.year,amount)]
    disb = disb.replace(tzinfo=None)
    plan_exp = plan_exp.replace(tzinfo=None) 
    total_days = (plan_exp-disb).days 
    total_days += 1
    total_amount = []
    curr = disb
    curr = curr.replace(tzinfo=None)
    for y in range(disb.year, plan_exp.year):
        dy = (dt.strptime(str(y)+'-12-31',"%Y-%m-%d").replace(tzinfo=None)-curr).days + 1
        if(total_days >0):
            total_amount.append( (y, dy * amount / total_days) )
        else:
            total_amount.append( (y, 0) )
        curr = dt.strptime(str(y+1)+'-01-01',"%Y-%m-%d")
        curr = curr.replace(tzinfo=None)
    dy = (plan_exp-curr).days + 1
    if(total_days >0):
        total_amount.append( (plan_exp.year, dy * amount / total_days) )
    else:
        total_amount.append( (plan_exp.year,0) )
    return total_amount

d_t = dt.strptime( '2016-12-01', "%Y-%m-%d")
p_e_t = dt.strptime( '2018-01-30', "%Y-%m-%d")
total_amount_of_loans(d_t, p_e_t, 5000)

[(2016, 363.84976525821594),
 (2017, 4284.037558685446),
 (2018, 352.11267605633805)]

In [26]:
import pandas as pd
import numpy as np
loans
loans_base = loans[['loan_id','loan_name','loan_amount','planned_expiration_time','disburse_time']]
loans_base

,loan_id,loan_name,loan_amount,planned_expiration_time,disburse_time
0,657307,Aivy,125.0,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000
1,657259,Idalia Marizza,400.0,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000
2,658010,Aasia,400.0,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000
3,659347,Gulmira,625.0,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000
4,656933,Ricky\t,425.0,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000
...,...,...,...,...,...
1419602,988180,NaN,400.0,2016-01-02 01:00:03.000 +0000,2015-11-23 08:00:00.000 +0000
1419603,988213,Perlita,300.0,2016-01-02 16:40:07.000 +0000,2015-11-24 08:00:00.000 +0000
1419604,989109,Okyeso Nyame Group,2425.0,2016-01-03 22:20:04.000 +0000,2015-11-13 08:00:00.000 +0000
1419605,989143,Exequila,100.0,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000
1419606,989240,Lydia,175.0,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000

In [30]:
lis = []
for index, row in loans_base.iterrows():
    s2 = row['planned_expiration_time']
    try:
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
    except ValueError:
        continue
    except TypeError:
        continue
    s1 = row['disburse_time']
    try:
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
    except ValueError:
        continue
    except TypeError:
        continue
    try:
        amt = float(row['loan_amount'])
    except ValueError:
        continue
    except TypeError:
        continue
    ls = total_amount_of_loans(d1, d2, amt)
    for l in ls:
        lis.append({ 'loan_id' : row['loan_id'], 'loan_name': row['loan_name'], 'loan_amount': row['loan_amount'], \
                    'planned_expiration_time': row['planned_expiration_time'], \
                    'disburse_time': row['disburse_time'],'year': l[0], 'ammount':l[1] })
loans_final = pd.DataFrame(lis) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_final

--- 394.8900270462036 seconds ---

,loan_id,loan_name,loan_amount,planned_expiration_time,disburse_time,year,ammount
0,657307,Aivy,125.0,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2013,20.833333
1,657307,Aivy,125.0,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014,104.166667
2,657259,Idalia Marizza,400.0,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2013,45.360825
3,657259,Idalia Marizza,400.0,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014,350.515464
4,658010,Aasia,400.0,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014,400.000000
...,...,...,...,...,...,...,...
1196549,989109,Okyeso Nyame Group,2425.0,2016-01-03 22:20:04.000 +0000,2015-11-13 08:00:00.000 +0000,2016,139.903846
1196550,989143,Exequila,100.0,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000,2015,90.625000
1196551,989143,Exequila,100.0,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000,2016,7.812500
1196552,989240,Lydia,175.0,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000,2015,163.709677
1196553,989240,Lydia,175.0,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000,2016,8.467742